Revit 2026 API

# DimensionSegmentTextPosition Property

---

The position of the dimension text's drag point.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ TextPosition { get; set; }
```
```vb
Public Property TextPosition As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ TextPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member TextPosition : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ApplicationException | Thrown when the dimension text is unavailable. |
| InvalidOperationException | Thrown when: |

  * The dimension text is a SpotElevation
  * When using equality formula.
  * When dimension style is ordinate.

.

This property is not applicable to all dimensions. For example, it is not available for spot dimensions, dimensions using equality formula, and when dimension style is ordinate.

If the position is not applicable, this property returns NULL and will not allow setting a value.

#### Reference

DimensionSegment Class

Autodesk.Revit.DB Namespace